brew "bat"
brew "python@3.14"
brew "black"
brew "bottom"
brew "btop"
brew "curlie"
brew "direnv"
brew "dua-cli"
brew "eza"
brew "fastfetch"
brew "fd"
brew "fish"
brew "fzf"
brew "gh"
brew "git-delta"
brew "glances"
brew "go"
brew "htop"
brew "httpie"
brew "jq"
brew "lazygit"
brew "llvm"
brew "lua-language-server"
brew "neovim"
brew "node"
brew "ollama", restart_service: :changed
brew "pipes-sh"
brew "poetry"
brew "prettier"
brew "pyright"
brew "ripgrep"
brew "rust"
brew "shellcheck"
brew "shfmt"
brew "starship"
brew "stylua"
brew "tldr"
brew "tmux"
brew "tree"
brew "tree-sitter"
brew "tree-sitter-cli"
brew "tty-clock"
brew "watchman"
brew "yazi"
brew "zellij"
brew "zoxide"
cask "docker-desktop"
cask "font-jetbrains-mono-nerd-font"
cask "iterm2"
cask "rectangle"
go "mvdan.cc/gofumpt"
go "golang.org/x/tools/cmd/goimports"
go "golang.org/x/tools/gopls"
